Για την εγκατάσταση και την χρήση του gitea χρειάζονται τα ακόλουθα βήματα:
	1. Εκτέλεση της εντολής make start ( από το node manager )
	2. Άνοιγμα ενός browser στο MANAGER_IP με port 3000
	3. Στο πεδίο host της mysql, θα πρέπει να μπεί το IP του worker που κάνει host το gitea_db.
	4. Επιλογή Συνέχεια.
	5. (Προαιρετικό) Για τη ρύθμιση του ssh pass through (δυνατότητα χρήσης ssh στο CLI), εκτέλεση της εντολής make setup_ssh
	
Πιθανά προβλήματα:

Εμείς, στις δοκιμές μας αντιμετωπίσαμε προβλήματα με το firewall που είχαμε βάλει στην υπηρεσία okeanos.
Επίσης αντιμετωπίσαμε πρόβλημα και με το VPN του ΠΑΔΑ καθώς δεν επέτρεπε στον worker να ανοίξει το port 3306.
